namespace Ritsukage.Library.FFXIV.WanaHome.Enum
{
    public enum Server
    {
        /// <summary>
        /// 未知服务器
        /// </summary>
        Unknown,
        //陆行鸟
        拉诺西亚 = 1042,
        幻影群岛 = 1044,
        萌芽池 = 1060,
        神意之地 = 1081,
        红玉海 = 1167,
        宇宙和音 = 1173,
        沃仙曦染 = 1174,
        晨曦王座 = 1175,
        //莫古力
        白金幻象 = 1076,
        旅人栈桥 = 1113,
        拂晓之间 = 1121,
        龙巢神殿 = 1166,
        潮风亭 = 1170,
        神拳痕 = 1171,
        白银乡 = 1172,
        梦羽宝境 = 1176,
        //猫小胖
        紫水栈桥 = 1043,
        摩杜纳 = 1045,
        静语庄园 = 1106,
        延夏 = 1169,
        海猫茶屋 = 1177,
        柔风海湾 = 1178,
        琥珀原 = 1179,
        //豆豆柴
        银泪湖 = 1183,
        水晶塔 = 1192,
        太阳海岸 = 1180,
        伊修加德 = 1186,
        红茶川 = 1201,
    }
}
